       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALTA-CLIENTES.
       AUTHOR. YOUR-NAME.
       DATE-WRITTEN. 2025-08-05.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           STOP RUN.
           