       IDENTIFICATION DIVISION.
       PROGRAM-ID. BUSCAR-CLIENTE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
        01 CLAVE-BANCARIA PIC 9(6).
        01 ID-CUENTA-STR PIC X(6).


        PROCEDURE DIVISION USING CLAVE-BANCARIA, ID-CUENTA-STR.
            DISPLAY "ESTA FUNCION LA DESARROLLA EL EQUIPO DE PABLO".
            MOVE "000000" TO ID-CUENTA-STR
            GOBACK.
