       01  R-RECORD.
           05 R-KEY.
              10 R-CBF        PIC 9(6).
              10 R-TIMESTAMP  PIC 9(14).
           05 R-DESCRIPCION   PIC X(1).
           05 R-IMPORTE       PIC S9(9)V99.
