       01  TRANSACCION.
               05  P-CBF                  PIC 9(6).
               05  P-DESCRIPCION          PIC X(1).
               05  P-IMPORTE              PIC S9(9)V99.
       01  RESULTADO PIC 9.
                   
