       01  REGISTRO-CLIENTE.
           05  CLI-CBF             PIC X(6).
           05  CLI-APELLIDO        PIC X(30).
           05  CLI-NOMBRE          PIC X(30).
           05  CLI-EMAIL           PIC X(50).
           