       01  CLIENTE.
           05  P-CBF             PIC X(6).
           05  P-APELLIDO        PIC X(30).
           05  P-NOMBRE          PIC X(30).
           05  P-EMAIL           PIC X(50).

           