       01  FILE-STATUS            PIC XX.
           88  FILE-SUCCESS       VALUE "00".
           88  FILE-NOT-FOUND     VALUE "23".
           88  FILE-NOT-READY     VALUE "35".
           88  FILE-DUPLICATE     VALUE "22".
           
           